In [35]:
data = [
    {"Transaction ID": 1001, "Customer Name": "Alice Smith", "Email": "alice@example.com", "Product": "Laptop", "Quantity": 1, "Price": 1200.00, "Purchase Date": "2024-09-15", "Delivery Status": True},
    {"Transaction ID": 1002, "Customer Name": "Bob Jones", "Email": None, "Product": "Headphones", "Quantity": 2, "Price": 150.00, "Purchase Date": "2024-09-16", "Delivery Status": True},
    {"Transaction ID": 1003, "Customer Name": "Charlie Johnson", "Email": "charlie#example.com", "Product": "Smartphone", "Quantity": 1, "Price": 800.00, "Purchase Date": "16/09/2024", "Delivery Status": True},
    {"Transaction ID": 1004, "Customer Name": "David Lee", "Email": "david.lee@example.com", "Product": "Laptop", "Quantity": 1, "Price": 1200.00, "Purchase Date": "2024-09-17", "Delivery Status": False},
    {"Transaction ID": 1005, "Customer Name": "Eve Martinez", "Email": "eve.martinez@example.com", "Product": "Smartwatch", "Quantity": 3, "Price": None, "Purchase Date": "17th Sep 2024", "Delivery Status": True},
    {"Transaction ID": 1006, "Customer Name": "Frank Wright", "Email": None, "Product": "Tablet", "Quantity": None, "Price": 600.00, "Purchase Date": "2024-09-18", "Delivery Status": False},
    {"Transaction ID": 1007, "Customer Name": "Grace Lee", "Email": "grace.lee@example.com", "Product": "Laptop", "Quantity": 1, "Price": 1200.00, "Purchase Date": "2024-09-19", "Delivery Status": True},
    {"Transaction ID": 1008, "Customer Name": "Hank Brown", "Email": "hank.brown@example.com", "Product": "Monitor", "Quantity": 2, "Price": 300.00, "Purchase Date": "09/19/2024", "Delivery Status": True},
    {"Transaction ID": 1009, "Customer Name": "Ivy Thompson", "Email": None, "Product": "Keyboard", "Quantity": 2, "Price": 100.00, "Purchase Date": "2024/09/20", "Delivery Status": False},
    {"Transaction ID": 1010, "Customer Name": "Jack Davis", "Email": "jack@example.com", "Product": "Mouse", "Quantity": 5, "Price": 50.00, "Purchase Date": "2024-09-21", "Delivery Status": True},
    {"Transaction ID": 1011, "Customer Name": "Alice Smith", "Email": "alice@example.com", "Product": "Laptop", "Quantity": 1, "Price": 1200.00, "Purchase Date": "2024-09-15", "Delivery Status": True},  # Duplicate entry
    {"Transaction ID": 1012, "Customer Name": "Kurt Evans", "Email": "kurt.evans@example.com", "Product": "Smartwatch", "Quantity": -1, "Price": 200.00, "Purchase Date": "2024-09-22", "Delivery Status": True},  # Outlier quantity
    {"Transaction ID": 1013, "Customer Name": "Liam Adams", "Email": "liam.adams@example.com", "Product": "Headphones", "Quantity": 2, "Price": 150.00, "Purchase Date": "2024-09-23", "Delivery Status": False},
    {"Transaction ID": 1014, "Customer Name": "Mia Clark", "Email": "mia.clark@example.com", "Product": None, "Quantity": 1, "Price": 0, "Purchase Date": "2024-09-24", "Delivery Status": True},  # Price anomaly
    {"Transaction ID": 1015, "Customer Name": "Nina Turner", "Email": None, "Product": "Tablet", "Quantity": 1, "Price": 600.00, "Purchase Date": "24-09-2024", "Delivery Status": True},
    {"Transaction ID": 1016, "Customer Name": "Oscar Harris", "Email": "oscar.harris@example.com", "Product": "Laptop", "Quantity": 2, "Price": 1200.00, "Purchase Date": "2024-09-25", "Delivery Status": True},
    {"Transaction ID": 1017, "Customer Name": "Paul Young", "Email": "paulyoung", "Product": "Monitor", "Quantity": 2, "Price": 300.00, "Purchase Date": "09/25/2024", "Delivery Status": True},
    {"Transaction ID": 1018, "Customer Name": "Quinn Lopez", "Email": None, "Product": "Smartphone", "Quantity": 1, "Price": 800.00, "Purchase Date": "2024-09-26", "Delivery Status": False},
    {"Transaction ID": 1019, "Customer Name": "Rachel Scott", "Email": "rachel.scott@example.com", "Product": "Keyboard", "Quantity": 2, "Price": 100.00, "Purchase Date": "2024-09-27", "Delivery Status": True},
    {"Transaction ID": 1020, "Customer Name": "Steve King", "Email": "steve.king@example.com", "Product": "Mouse", "Quantity": None, "Price": 50.00, "Purchase Date": "2024-09-28", "Delivery Status": True},
]

import pandas as pd 
import numpy as np
import seaborn as sns 
import matplotlib as plt

In [29]:
#Read the data 
df = pd.DataFrame(data)
df.head()

,Transaction ID,Customer Name,Email,Product,Quantity,Price,Purchase Date,Delivery Status
0,1001,Alice Smith,alice@example.com,Laptop,1.0,1200.0,2024-09-15,True
1,1002,Bob Jones,None,Headphones,2.0,150.0,2024-09-16,True
2,1003,Charlie Johnson,charlie#example.com,Smartphone,1.0,800.0,16/09/2024,True
3,1004,David Lee,david.lee@example.com,Laptop,1.0,1200.0,2024-09-17,False
4,1005,Eve Martinez,eve.martinez@example.com,Smartwatch,3.0,NaN,17th Sep 2024,True

In [30]:
mv = df.isnull()
print(mv)

    Transaction ID  Customer Name  Email  Product  Quantity  Price  \
0            False          False  False    False     False  False
1            False          False   True    False     False  False
2            False          False  False    False     False  False
3            False          False  False    False     False  False
4            False          False  False    False     False   True
5            False          False   True    False      True  False
6            False          False  False    False     False  False
7            False          False  False    False     False  False
8            False          False   True    False     False  False
9            False          False  False    False     False  False
10           False          False  False    False     False  False
11           False          False  False    False     False  False
12           False          False  False    False     False  False
13           False          False  False     True     False  False
14           False          False   True    False     False  False
15           False          False  False    False     False  False
16           False          False  False    False     False  False
17           False          False   True    False     False  False
18           False          False  False    False     False  False
19           False          False  False    False      True  False

    Purchase Date  Delivery Status
0           False            False
1           False            False
2           False            False
3           False            False
4           False            False
5           False            False
6           False            False
7           False            False
8           False            False
9           False            False
10          False            False
11          False            False
12          False            False
13          False            False
14          False            False
15          False            False
16          False            False
17          False            False
18          False            False
19          False            False

In [31]:
learners = {
        'names' : ['idrees','ibrahim','hazira','mel','aisyah','amin']
    }
x = pd.DataFrame(learners)
marks = [98,87,22,35,67,66]
state = ["J&K","Selangor","N9","Johor","Selangor","Penang"]
x['marks'] = marks
x['state'] = state

display(x)

     names  marks     state
0   idrees     98       J&K
1  ibrahim     87  Selangor
2   hazira     22        N9
3      mel     35     Johor
4   aisyah     67  Selangor
5     amin     66    Penang

In [32]:
job = {'J&K':'Consultant Expert','Selangor':'Lecturer','N9':'Chef','Johor':'Technician','Penang':'Content Creater'}
x['job'] = x['state'].map(job)
x

     names  marks     state                job
0   idrees     98       J&K  Consultant Expert
1  ibrahim     87  Selangor           Lecturer
2   hazira     22        N9               Chef
3      mel     35     Johor         Technician
4   aisyah     67  Selangor           Lecturer
5     amin     66    Penang    Content Creater

In [33]:
df.describe(include='all')
test = df.sample(20)
test
countnull = df.isnull().sum()
countnull

Transaction ID     0
Customer Name      0
Email              5
Product            1
Quantity           2
Price              1
Purchase Date      0
Delivery Status    0
dtype: int64